HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxQspi_reg.h
/** \\brief  20, Configuration Extension */
#define QSPI3_ECON0 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0001F20u)

/** \\brief  24, Configuration Extension */
#define QSPI3_ECON1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0001F24u)

/** \\brief  28, Configuration Extension */
#define QSPI3_ECON2 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0001F28u)

/** \\brief  2C, Configuration Extension */
#define QSPI3_ECON3 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0001F2Cu)

/** \\brief  30, Configuration Extension */
#define QSPI3_ECON4 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0001F30u)

/** \\brief  34, Configuration Extension */
#define QSPI3_ECON5 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0001F34u)

/** \\brief  38, Configuration Extension */
#define QSPI3_ECON6 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0001F38u)

/** \\brief  3C, Configuration Extension */
#define QSPI3_ECON7 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0001F3Cu)

/** \\brief  54, Flags Clear Register */
#define QSPI3_FLAGSCLEAR /*lint --e(923)*/ (*(volatile Ifx_QSPI_FLAGSCLEAR*)0xF0001F54u)

/** \\brief  10, Global Configuration Register */
#define QSPI3_GLOBALCON /*lint --e(923)*/ (*(volatile Ifx_QSPI_GLOBALCON*)0xF0001F10u)

/** \\brief  14, Global Configuration Register 1 */
#define QSPI3_GLOBALCON1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_GLOBALCON1*)0xF0001F14u)

/** \\brief  8, Module Identification Register */
#define QSPI3_ID /*lint --e(923)*/ (*(volatile Ifx_QSPI_ID*)0xF0001F08u)

/** \\brief  F4, Kernel Reset Register 0 */
#define QSPI3_KRST0 /*lint --e(923)*/ (*(volatile Ifx_QSPI_KRST0*)0xF0001FF4u)

/** \\brief  F0, Kernel Reset Register 1 */
#define QSPI3_KRST1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_KRST1*)0xF0001FF0u)

/** \\brief  EC, Kernel Reset Status Clear Register */
#define QSPI3_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_QSPI_KRSTCLR*)0xF0001FECu)

/** \\brief  5C, MIX_ENTRY Register */
#define QSPI3_MIXENTRY /*lint --e(923)*/ (*(volatile Ifx_QSPI_MIXENTRY*)0xF0001F5Cu)

/** \\brief  E8, OCDS Control and Status */
#define QSPI3_OCS /*lint --e(923)*/ (*(volatile Ifx_QSPI_OCS*)0xF0001FE8u)

/** \\brief  4, Port Input Select Register */
#define QSPI3_PISEL /*lint --e(923)*/ (*(volatile Ifx_QSPI_PISEL*)0xF0001F04u)

/** \\brief  90, RX_EXIT Register */
#define QSPI3_RXEXIT /*lint --e(923)*/ (*(volatile Ifx_QSPI_RXEXIT*)0xF0001F90u)

/** \\brief  94, RX_EXIT Debug Register */
#define QSPI3_RXEXITD /*lint --e(923)*/ (*(volatile Ifx_QSPI_RXEXITD*)0xF0001F94u)

/** \\brief  48, Slave Select Output Control Register */
#define QSPI3_SSOC /*lint --e(923)*/ (*(volatile Ifx_QSPI_SSOC*)0xF0001F48u)

/** \\brief  40, Status Register */
#define QSPI3_STATUS /*lint --e(923)*/ (*(volatile Ifx_QSPI_STATUS*)0xF0001F40u)

/** \\brief  44, Status Register 1 */
#define QSPI3_STATUS1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_STATUS1*)0xF0001F44u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Qspi_Cfg_Qspi4
 * \{  */

/** \\brief  FC, Access Enable Register 0 */
#define QSPI4_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ACCEN0*)0xF00020FCu)

/** \\brief  F8, Access Enable Register 1 */
#define QSPI4_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ACCEN1*)0xF00020F8u)

/** \\brief  18, Basic Configuration Register */
#define QSPI4_BACON /*lint --e(923)*/ (*(volatile Ifx_QSPI_BACON*)0xF0002018u)

/** \\brief  60, BACON_ENTRY Register */
#define QSPI4_BACONENTRY /*lint --e(923)*/ (*(volatile Ifx_QSPI_BACONENTRY*)0xF0002060u)

/** \\brief  A0, Capture Control Register */
#define QSPI4_CAPCON /*lint --e(923)*/ (*(volatile Ifx_QSPI_CAPCON*)0xF00020A0u)

/** \\brief  0, Clock Control Register */
#define QSPI4_CLC /*lint --e(923)*/ (*(volatile Ifx_QSPI_CLC*)0xF0002000u)

/** \\brief  64, DATA_ENTRY Register */
#define QSPI4_DATAENTRY0 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF0002064u)

/** \\brief  68, DATA_ENTRY Register */
#define QSPI4_DATAENTRY1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF0002068u)

/** \\brief  6C, DATA_ENTRY Register */
#define QSPI4_DATAENTRY2 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF000206Cu)

/** \\brief  70, DATA_ENTRY Register */
#define QSPI4_DATAENTRY3 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF0002070u)

/** \\brief  74, DATA_ENTRY Register */
#define QSPI4_DATAENTRY4 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF0002074u)

/** \\brief  78, DATA_ENTRY Register */
#define QSPI4_DATAENTRY5 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF0002078u)

/** \\brief  7C, DATA_ENTRY Register */
#define QSPI4_DATAENTRY6 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF000207Cu)

/** \\brief  80, DATA_ENTRY Register */
#define QSPI4_DATAENTRY7 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF0002080u)

/** \\brief  20, Configuration Extension */
#define QSPI4_ECON0 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0002020u)

/** \\brief  24, Configuration Extension */
#define QSPI4_ECON1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0002024u)

/** \\brief  28, Configuration Extension */
#define QSPI4_ECON2 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0002028u)

/** \\brief  2C, Configuration Extension */
#define QSPI4_ECON3 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF000202Cu)

/** \\brief  30, Configuration Extension */
#define QSPI4_ECON4 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0002030u)

/** \\brief  34, Configuration Extension */
#define QSPI4_ECON5 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0002034u)

/** \\brief  38, Configuration Extension */
#define QSPI4_ECON6 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0002038u)

/** \\brief  3C, Configuration Extension */
#define QSPI4_ECON7 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF000203Cu)

/** \\brief  54, Flags Clear Register */
#define QSPI4_FLAGSCLEAR /*lint --e(923)*/ (*(volatile Ifx_QSPI_FLAGSCLEAR*)0xF0002054u)

