HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxQspi_reg.h
/** \\brief  10, Global Configuration Register */
#define QSPI4_GLOBALCON /*lint --e(923)*/ (*(volatile Ifx_QSPI_GLOBALCON*)0xF0002010u)

/** \\brief  14, Global Configuration Register 1 */
#define QSPI4_GLOBALCON1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_GLOBALCON1*)0xF0002014u)

/** \\brief  8, Module Identification Register */
#define QSPI4_ID /*lint --e(923)*/ (*(volatile Ifx_QSPI_ID*)0xF0002008u)

/** \\brief  F4, Kernel Reset Register 0 */
#define QSPI4_KRST0 /*lint --e(923)*/ (*(volatile Ifx_QSPI_KRST0*)0xF00020F4u)

/** \\brief  F0, Kernel Reset Register 1 */
#define QSPI4_KRST1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_KRST1*)0xF00020F0u)

/** \\brief  EC, Kernel Reset Status Clear Register */
#define QSPI4_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_QSPI_KRSTCLR*)0xF00020ECu)

/** \\brief  5C, MIX_ENTRY Register */
#define QSPI4_MIXENTRY /*lint --e(923)*/ (*(volatile Ifx_QSPI_MIXENTRY*)0xF000205Cu)

/** \\brief  E8, OCDS Control and Status */
#define QSPI4_OCS /*lint --e(923)*/ (*(volatile Ifx_QSPI_OCS*)0xF00020E8u)

/** \\brief  4, Port Input Select Register */
#define QSPI4_PISEL /*lint --e(923)*/ (*(volatile Ifx_QSPI_PISEL*)0xF0002004u)

/** \\brief  90, RX_EXIT Register */
#define QSPI4_RXEXIT /*lint --e(923)*/ (*(volatile Ifx_QSPI_RXEXIT*)0xF0002090u)

/** \\brief  94, RX_EXIT Debug Register */
#define QSPI4_RXEXITD /*lint --e(923)*/ (*(volatile Ifx_QSPI_RXEXITD*)0xF0002094u)

/** \\brief  48, Slave Select Output Control Register */
#define QSPI4_SSOC /*lint --e(923)*/ (*(volatile Ifx_QSPI_SSOC*)0xF0002048u)

/** \\brief  40, Status Register */
#define QSPI4_STATUS /*lint --e(923)*/ (*(volatile Ifx_QSPI_STATUS*)0xF0002040u)

/** \\brief  44, Status Register 1 */
#define QSPI4_STATUS1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_STATUS1*)0xF0002044u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Qspi_Cfg_Qspi5
 * \{  */

/** \\brief  FC, Access Enable Register 0 */
#define QSPI5_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ACCEN0*)0xF00021FCu)

/** \\brief  F8, Access Enable Register 1 */
#define QSPI5_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ACCEN1*)0xF00021F8u)

/** \\brief  18, Basic Configuration Register */
#define QSPI5_BACON /*lint --e(923)*/ (*(volatile Ifx_QSPI_BACON*)0xF0002118u)

/** \\brief  60, BACON_ENTRY Register */
#define QSPI5_BACONENTRY /*lint --e(923)*/ (*(volatile Ifx_QSPI_BACONENTRY*)0xF0002160u)

/** \\brief  A0, Capture Control Register */
#define QSPI5_CAPCON /*lint --e(923)*/ (*(volatile Ifx_QSPI_CAPCON*)0xF00021A0u)

/** \\brief  0, Clock Control Register */
#define QSPI5_CLC /*lint --e(923)*/ (*(volatile Ifx_QSPI_CLC*)0xF0002100u)

/** \\brief  64, DATA_ENTRY Register */
#define QSPI5_DATAENTRY0 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF0002164u)

/** \\brief  68, DATA_ENTRY Register */
#define QSPI5_DATAENTRY1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF0002168u)

/** \\brief  6C, DATA_ENTRY Register */
#define QSPI5_DATAENTRY2 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF000216Cu)

/** \\brief  70, DATA_ENTRY Register */
#define QSPI5_DATAENTRY3 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF0002170u)

/** \\brief  74, DATA_ENTRY Register */
#define QSPI5_DATAENTRY4 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF0002174u)

/** \\brief  78, DATA_ENTRY Register */
#define QSPI5_DATAENTRY5 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF0002178u)

/** \\brief  7C, DATA_ENTRY Register */
#define QSPI5_DATAENTRY6 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF000217Cu)

/** \\brief  80, DATA_ENTRY Register */
#define QSPI5_DATAENTRY7 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF0002180u)

/** \\brief  20, Configuration Extension */
#define QSPI5_ECON0 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0002120u)

/** \\brief  24, Configuration Extension */
#define QSPI5_ECON1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0002124u)

/** \\brief  28, Configuration Extension */
#define QSPI5_ECON2 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0002128u)

/** \\brief  2C, Configuration Extension */
#define QSPI5_ECON3 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF000212Cu)

/** \\brief  30, Configuration Extension */
#define QSPI5_ECON4 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0002130u)

/** \\brief  34, Configuration Extension */
#define QSPI5_ECON5 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0002134u)

/** \\brief  38, Configuration Extension */
#define QSPI5_ECON6 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0002138u)

/** \\brief  3C, Configuration Extension */
#define QSPI5_ECON7 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF000213Cu)

/** \\brief  54, Flags Clear Register */
#define QSPI5_FLAGSCLEAR /*lint --e(923)*/ (*(volatile Ifx_QSPI_FLAGSCLEAR*)0xF0002154u)

/** \\brief  10, Global Configuration Register */
#define QSPI5_GLOBALCON /*lint --e(923)*/ (*(volatile Ifx_QSPI_GLOBALCON*)0xF0002110u)

/** \\brief  14, Global Configuration Register 1 */
#define QSPI5_GLOBALCON1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_GLOBALCON1*)0xF0002114u)

/** \\brief  8, Module Identification Register */
#define QSPI5_ID /*lint --e(923)*/ (*(volatile Ifx_QSPI_ID*)0xF0002108u)

/** \\brief  F4, Kernel Reset Register 0 */
#define QSPI5_KRST0 /*lint --e(923)*/ (*(volatile Ifx_QSPI_KRST0*)0xF00021F4u)

/** \\brief  F0, Kernel Reset Register 1 */
#define QSPI5_KRST1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_KRST1*)0xF00021F0u)

/** \\brief  EC, Kernel Reset Status Clear Register */
#define QSPI5_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_QSPI_KRSTCLR*)0xF00021ECu)

/** \\brief  5C, MIX_ENTRY Register */
#define QSPI5_MIXENTRY /*lint --e(923)*/ (*(volatile Ifx_QSPI_MIXENTRY*)0xF000215Cu)

/** \\brief  E8, OCDS Control and Status */
#define QSPI5_OCS /*lint --e(923)*/ (*(volatile Ifx_QSPI_OCS*)0xF00021E8u)

/** \\brief  4, Port Input Select Register */
#define QSPI5_PISEL /*lint --e(923)*/ (*(volatile Ifx_QSPI_PISEL*)0xF0002104u)

/** \\brief  90, RX_EXIT Register */
#define QSPI5_RXEXIT /*lint --e(923)*/ (*(volatile Ifx_QSPI_RXEXIT*)0xF0002190u)

/** \\brief  94, RX_EXIT Debug Register */
#define QSPI5_RXEXITD /*lint --e(923)*/ (*(volatile Ifx_QSPI_RXEXITD*)0xF0002194u)

/** \\brief  48, Slave Select Output Control Register */
#define QSPI5_SSOC /*lint --e(923)*/ (*(volatile Ifx_QSPI_SSOC*)0xF0002148u)

/** \\brief  40, Status Register */
#define QSPI5_STATUS /*lint --e(923)*/ (*(volatile Ifx_QSPI_STATUS*)0xF0002140u)

/** \\brief  44, Status Register 1 */
#define QSPI5_STATUS1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_STATUS1*)0xF0002144u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXQSPI_REG_H */
